code-review/NRB_3471_3546/База_Было/InformationRegisters/Котировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Котировки</Name>
			<Comment>Котировки ценных бумаг</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>volume</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>value</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OpenPeriod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Open</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Low</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>High</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>last_price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LowOffer</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HighBid</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WAPrice</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClosePeriod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TrendClose</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TrendWAP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Bid</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Offer</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Prev</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>YieldAtWAP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>YieldClose</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Nkd</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AccInt</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РыночнаяЦена</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>trades_num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueSize</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TrendClsPr</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TrendWapPr</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MatDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MarketPrice2</Name>
					<Comment>Для расчета рыночной стоимости активов, в которые инвестированы средства пенсионных накоплений</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнаваемаяКотировка</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КотировальныйЛист</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PrevLegalClosePrice</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LegalOpenPrice</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LegalClosePrice</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OpenVal</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CloseVal</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Залог</Name>
					<Comment>Размер ДС, блокируемых под одну позицию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MarketPrice3</Name>
					<Comment>Для расчета рыночной стоимости активов, в которые инвестированы средства пенсионных накоплений</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>indicative_price</Name>
					<Comment>для загрузки индикативной цены из CBonds</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВалютаКотировки</Name>
					<Comment>Валюта котировки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НулевойНКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКотировкаОсновногоИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационноАналитическиеСистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РежимТоргов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыТоргов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникКотировок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиКотировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СостоянияРасчетаРыночныхЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияРасчетаРыночныхЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачалоРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеДанных</Name>
					<Comment>Ожидание ответа на запрос котировок из BQ (и возможно также из Diasoft, в зависимости от методики расчета)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеПолучены</Name>
					<Comment>Получены котировки из BQ (и возможно также из Diasoft, в зависимости от методики расчета)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаРасчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/ПолучениеЦеныПоследнейСделки/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Создает запрос цен последних сделок к backQORT и возвращает идентификатор запроса
// Возвращает вид расчета строкой в пераметре НовыйРезультатРасчета
//
// Параметры:
//  СквозныеПараметры	 - Структура - структура с параметрами расчета рыночных цен ЦБ, в том числе используемые тут:
//  ----.*ДатаРасчета			 - Дата - дата, за которую выполняется расчет
//  ЦенныеБумагиКЗапросу		 - ТаблицаЗначений - ценные бумаги, по которым нужно получить цену последней сделки из
//  								BQ и их коды
//
// Возвращаемое значение:
//  Строка - УИД сообщения Кафка с запросом цен последней сделки в BQ в форме строки
Функция ЗапросBQ(СквозныеПараметры, ЦенныеБумагиКЗапросу) Экспорт
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaMultiToBqRequestData1643;
	Ключ = "Request";
	
	Assets = Новый Массив;
	Для Каждого ЦеннаяБумага Из ЦенныеБумагиКЗапросу Цикл
		Asset = Новый Структура("Isin, RegNum");
		Asset.Isin = ЦеннаяБумага.Isin;
		Asset.RegNum = ?(ЗначениеЗаполнено(ЦеннаяБумага.НомерРегистрации), ЦеннаяБумага.НомерРегистрации, Неопределено);
		Assets.Добавить(Asset);
	КонецЦикла;
	
	Parameters = Новый Структура;
	Parameters.Вставить("Assets", Assets);
	
	УИДСообщения = Строка(Новый УникальныйИдентификатор());
	
	DateEnd = НачалоДня(СквозныеПараметры.ДатаРасчета);
	Если СквозныеПараметры.МетодикаРасчета = Перечисления.МетодикиРасчетаРыночныхЦен.Для481 Тогда
		Дней90 = 90;
		DateStart = DateEnd - ОбщегоНазначенияПовтИсп.СекундВСутках(Дней90);
	Иначе
		МесяцевВГоду = 12;
		DateStart = ДобавитьМесяц(DateEnd, - МесяцевВГоду) + ОбщегоНазначенияПовтИсп.СекундВСутках();
	КонецЕсли;
	
	RequestSystem = "BQ";
	ТекстJSON = СформироватьЗапросПоследнихЦенСделокJSON(УИДСообщения, RequestSystem, DateStart, DateEnd, Parameters);
	Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Ключ, ТекстJSON, УИДСообщения);
	
	Возврат УИДСообщения;
	
КонецФункции

// Создает запрос цен последних сделок к Diasoft и возвращает идентификатор запроса
// Возвращает вид расчета строкой в пераметре НовыйРезультатРасчета
//
// Параметры:
//  СквозныеПараметры	 - Структура - структура с параметрами расчета рыночных цен ЦБ, в том числе используемые тут:
//  ----.*ДатаРасчета			 - Дата - дата, за которую выполняется расчет
//  ЦенныеБумагиКЗапросу		 - ТаблицаЗначений - ценные бумаги, по которым нужно получить цену последней сделки из
//  								Diasoft и их коды
//
// Возвращаемое значение:
//  Строка - УИД сообщения Кафка с запросом цен последней сделки в BQ в форме строки
Функция ЗапросDiasoft(СквозныеПараметры, ЦенныеБумагиКЗапросу) Экспорт
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaMultiToDiasRequestData1655;
	Ключ = "Request";
	
	Assets = Новый Массив;
	Для Каждого ЦеннаяБумага Из ЦенныеБумагиКЗапросу Цикл
		Asset = Новый Структура("AssetCode, Isin, RegNum");
		Asset.Isin = ЦеннаяБумага.Isin;
		Asset.RegNum = ?(ЗначениеЗаполнено(ЦеннаяБумага.НомерРегистрации), ЦеннаяБумага.НомерРегистрации, Неопределено);
		Asset.AssetCode = ?(ЗначениеЗаполнено(ЦеннаяБумага.КодНРД), СокрЛП(ЦеннаяБумага.КодНРД), Неопределено);
		Assets.Добавить(Asset);
	КонецЦикла;
	
	Parameters = Новый Структура;
	Parameters.Вставить("Assets", Assets);
	
	Дней90 = 90;
	DateEnd = НачалоДня(СквозныеПараметры.ДатаРасчета);
	DateStart = DateEnd - ОбщегоНазначенияПовтИсп.СекундВСутках(Дней90);
	
	RequestSystem = "DIAS";
	УИДСообщения = Строка(Новый УникальныйИдентификатор());
	ТекстJSON = СформироватьЗапросПоследнихЦенСделокJSON(УИДСообщения, RequestSystem, DateStart, DateEnd, Parameters);
	Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Ключ, ТекстJSON, УИДСообщения);
	
	Возврат УИДСообщения;
	
КонецФункции

// Процедура - Выполнить создание записей котировок цен последней сделки по данным из Kafka (из backQORT).
// Неявным образом вызывается из обработчика регламентного задания ПолучениеЦеныПоследнейСделкиИзBQ.
//
// Параметры:
//  Выборка	 - Выборка - Выборка данных из РС ЖурналВходящихСообщенийKafka
//
Процедура ВыполнитьСоздание(Выборка) Экспорт
	
	ИмяСвойстваОписаниеОшибки = "ОписаниеОшибки";
	ИмяСобытия = "СозданиеЦеныПоследнейСделкиПоДаннымKafka";
	
	ТекстОшибки = "";
	
	Попытка
		MessageInfo = ОбменДаннымиКафка.ДанныеMessageInfo();
		Сообщение = РаботаСJSON.РезультатЧтенияJSON(Выборка.Сообщение);
		ОбменДаннымиКафка.ПодготовитьMessageInfo(Сообщение.MessageInfo, MessageInfo, ИмяСобытия, ТекстОшибки);
		СистемаОтправитель = ВРег(СокрЛП(MessageInfo.SystemSource));
		Если СистемаОтправитель = "BQ" Тогда
			Биржа = Справочники.ИнформационноАналитическиеСистемы.BQ;
		ИначеЕсли СистемаОтправитель = "DIAS" Тогда
			Биржа = Справочники.ИнформационноАналитическиеСистемы.Diasoft;
		Иначе
			Возврат;
		КонецЕсли;
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить(ИмяСвойстваОписаниеОшибки, ОписаниеОшибки);
	КонецПопытки;
	
	ИдЗапроса = MessageInfo.ParentMessageId;
	СостояниеРасчета = РегистрыСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг.СостояниеРасчетаПоИдентификаторуЗапроса(ИдЗапроса, ТекстОшибки);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
	Попытка
		Data = Сообщение.Data;
	Исключение
		СтроковыеФункцииКлиентСервер.ДополнитьТекстСтрокой(ТекстОшибки, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить(ИмяСвойстваОписаниеОшибки, ОписаниеОшибки);
	КонецПопытки;
	
	Цены = ЦеныПоследнейСделки(Data, ТекстОшибки);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		ЗаписатьЦеныПоследнейСделкиОбновивСостояниеРасчета(СостояниеРасчета, Цены, Биржа, ТекстОшибки);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		Иначе
			РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗавершитьОбработку(Выборка.ВнешнийИсточник, Выборка.Идентификатор);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ОписаниеОшибки));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Формирует запрос последних цен сделок в формате JSON
//
// Параметры:
//	УИДСообщения - Строка - УИД в строком представлении
//	RequestSystem - Строка - Система в котрую направлен запрос: либо "BQ" либо "DIAS"
//	DateStart - Дата - Дата начала периода, за который нужно получить котировки
//	DateEnd - Дата - Дата конца периода, за который нужно получить котировки
//	Parameters - Структура - Должна включать элемент с ключом Assets и значением представляющим собой массив структур
//					каждая из которых содержит различные коды ЦБ (Isin, RegNum, AssetCode, из котрых обязательный - Isin)
//
// Возвращаемое значение:
//  Строка - текст сообщение в формате JSON
//
Функция СформироватьЗапросПоследнихЦенСделокJSON(УИДСообщения, RequestSystem, DateStart, DateEnd, Parameters) Экспорт
	
	MessageInfo = РаботаСJSON.СтруктураMessageInfo();
	MessageInfo.MessageType = "Request";
	MessageInfo.JsonVersion = "1.1.0";
	MessageInfo.MessageId = УИДСообщения;
	MessageInfo.SystemSource = "Depo";
	MessageInfo.ActionType = "GET";
	MessageInfo.MasterMessageId = УИДСообщения;
	MessageInfo.ParentMessageId = Неопределено;
	MessageInfo.DateTimeCreate = ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO);
	
	Data = Новый Структура;
	Data.Вставить("RequestType", "LastTradePrice");
	Data.Вставить("RequestSystem", RequestSystem);
	Data.Вставить("DateStart", ЗаписатьДатуJSON(DateStart, ФорматДатыJSON.ISO) );
	Data.Вставить("DateEnd", ЗаписатьДатуJSON(DateEnd, ФорматДатыJSON.ISO) );
	Data.Вставить("Parameters", Parameters);
	
	ТекстЗапросаJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Возврат ТекстЗапросаJSON;
	
КонецФункции

Функция ЦеныПоследнейСделки(Data, ТекстОшибки)
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Не Data.Свойство("Assets") Тогда
		ТекстОшибки = "Отсутствует [Assets]";
		Возврат Неопределено;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Data.Assets) Тогда
		Возврат Новый Массив;
	Иначе
		Возврат Data.Assets;
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьЦеныПоследнейСделкиОбновивСостояниеРасчета(СквозныеПараметры, Цены, Биржа, ТекстОшибки)
	
	// Получим исходные параметры запроса
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	ПараметрыЗапроса = СтрРазделить(СквозныеПараметры.ПараметрыМетода, ";", Ложь);
	ПараметрПоОстаткам = СтрРазделить(ПараметрыЗапроса[0], "=");
	ПоОстаткам = ОписаниеТипаБулево.ПривестиЗначение(ПараметрПоОстаткам[1]);
	ПараметрISIN = СтрРазделить(ПараметрыЗапроса[1], "=");
	ISINs = ПараметрISIN[1];
	
	// Произведем запись цены последней сделки из массива структур Цены
	ВернутьВсеЦенныеБумагиНайденныеПоУсловию = Истина;
	КешВалют = Справочники.Валюты.КешВалют(ТекущаяДатаСеанса());
	Для Каждого ЦеннаяБумагаСЦеной Из Цены Цикл
		ИмяСвойстваСЦеной = ?(Биржа = Справочники.ИнформационноАналитическиеСистемы.BQ, "BrokerTrade", "DealerTrade");
		ЕстьЦена = ЦеннаяБумагаСЦеной.Свойство("Asset") И ЗначениеЗаполнено(ЦеннаяБумагаСЦеной.Asset)
					И ЦеннаяБумагаСЦеной.Свойство(ИмяСвойстваСЦеной) И ЗначениеЗаполнено(ЦеннаяБумагаСЦеной[ИмяСвойстваСЦеной]);
		Если ЕстьЦена Тогда
			ЗаписатьВсеЦеныПоследнихСделок(ЦеннаяБумагаСЦеной, ИмяСвойстваСЦеной, Биржа, КешВалют, ВернутьВсеЦенныеБумагиНайденныеПоУсловию,
											ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
		
	СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.ПолучениеДанных;
	Если Биржа = Справочники.ИнформационноАналитическиеСистемы.BQ Тогда
		СквозныеПараметры.ПолученОтветBQ = Истина;
	КонецЕсли;
	Если Биржа = Справочники.ИнформационноАналитическиеСистемы.Diasoft Тогда
		СквозныеПараметры.ПолученОтветDiasoft = Истина;
	КонецЕсли;
	Если СквозныеПараметры.МетодикаРасчета = Перечисления.МетодикиРасчетаРыночныхЦен.Для481
			И СквозныеПараметры.ПолученОтветBQ И СквозныеПараметры.ПолученОтветDiasoft Тогда
		СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.ДанныеПолучены;
	КонецЕсли;
	Если СквозныеПараметры.МетодикаРасчета = Перечисления.МетодикиРасчетаРыночныхЦен.Для0409404
		И СквозныеПараметры.ПолученОтветBQ Тогда
		СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.ДанныеПолучены;
	КонецЕсли;
	РегистрыСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг.УстановитьСостояние(СквозныеПараметры, СостояниеСтало, ISINs);
	
	Если СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.ДанныеПолучены Тогда
		ПроизвестиОкончательныйРасчетРыночныхЦенЦБ(СквозныеПараметры, ПоОстаткам, ISINs);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроизвестиОкончательныйРасчетРыночныхЦенЦБ(СквозныеПараметры, ПоОстаткам, ISINs)
	Отказ					 = Ложь;
	ТекстОтказа				 = "";
	ОтправлятьУведомление	 = СквозныеПараметры.Регламент;
	
	ВходящиеПараметры = Новый Структура;
	ВходящиеПараметры.Вставить("ПоОстаткам", ПоОстаткам);
	ВходящиеПараметры.Вставить("ISINs", ISINs);
	ВходящиеПараметры.Вставить("ЗапросЦеныПоследнейСделкиПоISIN", Ложь);
	ВходящиеПараметры.Вставить("БезЗапросаЦеныПоследнейСделки", Истина);
	ВходящиеПараметры.Вставить("МетодикаРасчета", СквозныеПараметры.МетодикаРасчета);
	Если СквозныеПараметры.МетодикаРасчета = Перечисления.МетодикиРасчетаРыночныхЦен.Для0409404 Тогда
		НачалоПериода			 = НачалоДня(СквозныеПараметры.ДатаРасчета);
		ОкончаниеПериода		 = КонецДня(СквозныеПараметры.ДатаРасчета);
		ВходящиеПараметры.Вставить("НачалоПериода", НачалоПериода);
		ВходящиеПараметры.Вставить("ОкончаниеПериода", ОкончаниеПериода);
		РасчетРыночныхЦенДля0409404.РассчитатьРыночныеЦены(ВходящиеПараметры, Отказ, ТекстОтказа, ОтправлятьУведомление);
	ИначеЕсли СквозныеПараметры.МетодикаРасчета = Перечисления.МетодикиРасчетаРыночныхЦен.Для481 Тогда
		ВходящиеПараметры.Вставить("ДатаРасчета", СквозныеПараметры.ДатаРасчета);
		РасчетРыночныхЦенДля481.РассчитатьРыночныеЦены(ВходящиеПараметры, Отказ, ТекстОтказа, ОтправлятьУведомление);
	Иначе
		ВызватьИсключение("Неизвестная методика расчета рыночных цен ЦБ");
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьВсеЦеныПоследнихСделок(ЦеннаяБумагаСЦеной, ИмяСвойстваСЦеной, Биржа, КешВалют, ВернутьВсеЦенныеБумагиНайденныеПоУсловию,
										ТекстОшибки)
	ЦеннаяБумага = ЦеннаяБумагаСЦеной.Asset;
	Сделка = ЦеннаяБумагаСЦеной[ИмяСвойстваСЦеной];
	ЦенаПоследнейСделки = ?(ЗначениеЗаполнено(Сделка.Price), Сделка.Price, 0);
	Если ЦенаПоследнейСделки > 0 Тогда
		ЦенныеБумаги = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоРегНомеруИISIN(ЦеннаяБумага.ISIN,
			?(ЗначениеЗаполнено(ЦеннаяБумага.RegNum), ЦеннаяБумага.RegNum, Неопределено), ВернутьВсеЦенныеБумагиНайденныеПоУсловию);
		Если ЦенныеБумаги = Неопределено Тогда
			ТекущаяОшибка = "Не найдена ЦБ по ISIN: [" + ЦеннаяБумага.ISIN + "] и Рег.номеру: [" + ЦеннаяБумага.RegNum + "]";
			СтроковыеФункцииКлиентСервер.ДополнитьТекстСтрокой(ТекстОшибки, ТекущаяОшибка);
		КонецЕсли;
		ВалютаПоследнейСделки = КешВалют[Сделка.CurrencyCode].Валюта;
		ДатаСделки = Сделка.Date;
		ПозицияМиллисекунд = СтрНайти(ДатаСделки, ".");
		Если ПозицияМиллисекунд > 0 Тогда
			ДатаСделки = Сред(ДатаСделки, 1, ПозицияМиллисекунд - 1);
		КонецЕсли;
		ПериодПоследнейСделки = ПрочитатьДатуJSON(ДатаСделки, ФорматДатыJSON.ISO);
		Для Каждого ЦенныеБумагиСсылка Из ЦенныеБумаги Цикл
			ЗаписатьЦенуПоследнейСделки(ПериодПоследнейСделки, ЦенныеБумагиСсылка, Биржа, ЦенаПоследнейСделки, ВалютаПоследнейСделки);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьЦенуПоследнейСделки(ПериодПоследнейСделки, ЦеннаяБумага, Биржа, ЦенаПоследнейСделки, ВалютаПоследнейСделки)
	
	Период = НачалоДня(ПериодПоследнейСделки);
	РежимТоргов = Справочники.РежимыТоргов.Индикативный;
	
	НаборЗаписей = РегистрыСведений.Котировки.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.ЦеннаяБумага.Установить(ЦеннаяБумага);
	НаборЗаписей.Отбор.Биржа.Установить(Биржа);
	НаборЗаписей.Отбор.РежимТоргов.Установить(РежимТоргов);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;
	НоваяЗапись.ЦеннаяБумага = ЦеннаяБумага;
	НоваяЗапись.Биржа = Биржа;
	НоваяЗапись.РежимТоргов = РежимТоргов;
	НоваяЗапись.indicative_price = ЦенаПоследнейСделки;
	НоваяЗапись.ВалютаКотировки = ВалютаПоследнейСделки;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
